In [175]:
# pre-processing
import pandas as pd
import numpy as np
df = pd.read_csv("C:/Users/Brandon/Documents/GitHub/bt3103-1d4-statistical-learning/src/data/titanic.csv")

In [168]:
# import plt
import matplotlib.pyplot as plt

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [184]:
df_cabin = pd.get_dummies(df["Cabin"])
df.columns.unique()

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare',
       ...
       'E8', 'F E69', 'F G63', 'F G73', 'F2', 'F33', 'F38', 'F4', 'G6', 'T'],
      dtype='object', length=159)

In [119]:
df["Sex"] = df_sex["female"]
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

In [161]:
df = pd.read_csv("C:/Users/Brandon/Documents/GitHub/bt3103-1d4-statistical-learning/src/data/titanic.csv")
df_embarked = pd.get_dummies(data = df["Embarked"], dummy_na = True)
df_embarked.head() # Peek at the top 5 rows

   C  Q  S  NaN
0  0  0  1    0
1  1  0  0    0
2  0  0  1    0
3  0  0  1    0
4  0  0  1    0

In [162]:
df_embarked = df_embarked.drop(np.nan,axis = 1)
df = pd.concat([df,df_embarked], axis = 1)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,C,Q,S
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,0,1

In [165]:
len(df["Name"].unique())

891

In [ ]:
plt.figure(figsize=(15,8))
plt.scatter(df['Fare'], df['Survived'],s = 15)
plt.title('Plot of Survived against Fare')
plt.xlabel('Fare')
plt.ylabel('Survived')
plt.show()

In [ ]:
plt.figure(figsize=(15,8))
plt.scatter(df['Fare'], df['Survived'],s = 15)
plt.title('Plot of Survived against Fare')
plt.xlabel('Fare')
plt.ylabel('Survived')
plt.plot(np.unique(df['Fare']), np.poly1d(np.polyfit(df['Fare'], df['Survived'], 1))(np.unique(df['Fare'])), color = 'r')
plt.show()

In [ ]:
import seaborn as sns
sns.regplot(x='Fare', y='Survived', data=df, logistic=True)

In [ ]:
# import the required packages
import statsmodels.formula.api as smf
import statsmodels
probit = smf.probit(formula='Survived ~ Fare + Pclass + Age', data=df)
result = probit.fit()